[
	{
		"ques_body": "次の特徴を持つ記憶素子の名称を解答",
		"ans": [
			["SRAM", "フリップフロップを用いる。高速であり、キャッシュなどに用いられる。"],
			["UV-EPROM", "専用の装置でデータを書き込み、紫外線で全内容の消去ができる。"],
			["DRAM", "コンデンサを用いる。周期的にデータの再書き込みが必要である。"],
			["フラッシュメモリ", "ブロック単位で電気的に消去できる。"]
		]
	},
	{
		"ques_body": "記憶装置について",
		"ans": [
			["仮想記憶", "優先度の低いプログラムを主記憶装置から補助記憶装置上に退避するための領域"],
			["キャッシュメモリ方式", "高速なSRAMと低速な主記憶装置やバスの間の速度の差を小さくする"],
			["ダイレクトメモリアクセス", "CPUを介さずに装置間で主記憶装置のデータを転送する"],
			["メモリインタリーブ", "主記憶装置をいくつかのアクセス単位に分割しそれらを並行動作させて実効アクセス時間を短縮する"]
		]
	},
	{
		"ques_body": "記録媒体の記録層として有機色素を使い、レーザ光によってピットと呼ばれる焦げ跡を作ってデータを記録する光ディスク",
		"ans": [
			"CD-R",
			"CD-RW",
			"DVD-RAM",
			"DVD-ROM"
		],
		"answer": "CD-R"
	},
	{
		"ques_body": "USBハブを用いて接続できる機器の数は最大で何台か",
		"ans": [
			"125",
			"126",
			"127",
			"128"
		],
		"answer": "127"
	},
	{
		"ques_body": "ディスプレイについて",
		"ans": [
			["プラズマディスプレイパネル", "ガス放電に伴う発光を利用する"],
			["TFT液晶", "画面の各ドットを薄膜トランジスタで制御し、光の透過率を変化させる"],
			["有機EL", "電圧を加えると発光する有機化合物を用いる"],
			["CRT", "電子銃から電子ビームを発射し、蛍光体にあてて発光させる"]
		]
	},
	{
		"ques_body": "電源を入れたままケーブルを着脱できる、ホットスワップに対応しないインターフェースを選択",
		"ans": [
			"IEEE 1394",
			"USB",
			"SATA",
			"SCSI"
		],
		"answer": "SCSI"
	},
	{	"ques_body": "説明に該当するものを選択",
		"ans": [
			["DHCP", "PCなどからのIPアドレス付与の要求に対し、サーバに登録してあるIPアドレスの中から使用されていないIPアドレスを割り当てる"],
			["DNS", "ドメイン名とIPアドレスを関連付ける"],
			["NAT", "社内のプライベートIPアドレスをグローバルIPアドレスに変換し、インターネットへのアクセスを可能にする"],
			["スプリッタ", "ADSLにおいて音声信号とデータ信号を分離する"]
		]
	},
	{
		"ques_body": "説明に該当するものを選択",
		"ans": [
			["データウェアハウス", "大量に蓄積されたデータを整理・統合して蓄積しておき、意思決定支援などに利用する"],
			["データマイニング", "大量に蓄積されたデータから、ビジネスなどに有効な情報を統計学的手法などを用いて新たに見つけ出すプロセス"],
			["データディクショナリ", "データの一貫性を保つために、意味、他のデータとの関係、書式などを列挙したデータベースや書類のこと"],
			["メタデータ", "作成日時や作成者、タイトルなどのあるデータに関連するデータのこと"],
		]
	},
	{
		"ques_body": "プロトコルについて",
		"ans": [
			["NNTP", "ネットニュースの閲覧や投稿の際に使用する"],
			["NTP", "ネットワークを通じて正しい現在時刻を取得する"],
			["SMTP", "メールの送信やサーバ間のメールの転送に用いる"],
			["SNMP", "構成機器や障害時の情報収集を行う"]
		]
	},
	{
		"ques_body": "攻撃手法について",
		"ans": [
			["DoS攻撃", "ネットワーク上の通信量を増大させ、通信を処理している回線やサーバの処理能力を占有し、システムを使用不能にする"],
			["辞書攻撃", "辞書にある単語を片っ端から入力しパスワードを割り出したり暗号を解読する"],
			["トロイの木馬", "データの破壊や改ざんなどの不正な機能をプログラムの一部に組み込んだものを誤ってインストール・実行させる"],
			["バッファオーバーフロー攻撃", "システムに想定されているサイズ以上のデータを送り付け、データをあふれさせてシステムを破壊したり不正なプログラムを実行させる"]
		]
	},
	{
		"ques_body": "ソフトウェアについて",
		"ans": [
			["JavaScript" , "WEBページに動きや対話性を付加するために、ブラウザに搭載されたスクリプト言語"],
			["Javaアプリケーション", "WebブラウザやWebサーバがなくてもJava VMがあれば動作するプログラム"],
			["Javaアプレット", "実行時にサーバからプログラムをダウンロードし、Webブラウザ上のJava VMで動作するプログラム"],
			["Javaサーブレット", "Webサーバ上で実行される、動的なWEBページの提供やデータ処理を行うプログラム"]
		]
	},
	{
	"ques_body": "ハードウェアについて", 
		"ans": [
			["スワッピング", "主記憶装置上のデータを仮想の記憶領域へうつし、主記憶装置上に使用可能な領域を確保する"],
			["スプーリング", "処理効率を高めるために主記憶装置と低速の出力装置の間に高速の補助記憶装置を介する"],
			["ブロッキング", "特定の利用者や機器、ポートなどからの接続・通信の中継をを拒否すること"],
			["ページング", "仮想記憶を含めたメモリの領域を一定の大きさのページに分割して物理的なアドレスとは別に仮想的なアドレスを割り当てる"]
		]
	},
	{
		"ques_body": "WEBサーバにおいて、クライアントからの要求に応じてプログラムを実行し、その結果をブラウザに返すなどの動的なページを実現するために、Webサーバと外部プログラムを連携する",
		"ans": [
			"CGI",
			"HTML",
			"MIME",
			"URL"
		],
		"answer": "CGI"
	},
	{
		"ques_body": "ソフトウェアの品質について",
		"ans": [
			["移植性", "ソフトウェアをある環境から別の環境に移行する際の容易さ"],
			["使用性", "ユーザからみたソフトウェアやWebサイトの使いやすさ、わかりやすさ"],
			["相互運用性", "仕様の異なるコンピュータ間で相互運用するための性能"],
			["可用性", "システムが継続して稼働できる能力"]
		]
	},
	{
		"ques_body": "ITについて",
		"ans": [
			["SaaS", "自社ではソフトウェアを所有せずに、外部の専門業者が提供するソフトウェアの機能をネットワーク経由で活用する"],
			["ホスティング（レンタルサーバ）", "自社ではサーバを所有せずに、通信事業者などが保有するサーバの処理能力や記憶容量の一部を借りてシステムを運用する"],
			["BPO", "自社の管理部門やコールセンタなどの特定部門の業務プロセス全般を、業務システムの運用などと一体として外部の専門業者に委託する"],
			["派遣契約", "自社よりも人件費の安い派遣会社の社員を活用することで、ソフトウェア開発の費用を低減させる"]
		]
	},
	{
		"ques_body": "ITについて",
		"ans": [
			["モバイルコンピューティング", "携帯電話や自動車電話のように、利用者が移動しながら通信端末を利用することができる環境"],
			["アクセシビリティ", "高齢者や障害者でも容易に情報機器を活用でき、情報サービスを受けることができる環境"],
			["テレコミューティング", "情報通信手段の活用にとって、通勤時の時間的・精神的なロスのない勤務形態を実現できる環境"],
			["ユビキタスシステム", "モバイルコンピューティング、ホームネットワークなどにとってコンピュータ利用の利便性が増した環境"]
		]
	},
	{
		"ques_body": "データの整列方法について",
		"ans": [
			["シェルソート", "ある一定間隔おきに取り出した要素から成る部分列をそれぞれ整列し、更に間隔を詰めて同様の操作を行い、間隔が1になるまでそれを繰り替えす"],
			["バブルソート", "隣り合う要素を比較して、大小の順が逆であれば、それらの要素を入れ替えるという操作を繰り返す"],
			["クイックソート", "中間的な基準値を決めて、それよりも大きな値を集めた区分と小さない値を集めた区分に要素を振り分ける。次に、それぞれの区分の中で同様な処理を繰り返す"],
			["ヒープソート", "未整列の部分を順序木に構成し、そこから最大値または最小値を取り出して既整列の部分に移す。この操作を繰り返して、未整列部分を縮めていく。"]
		]
	},
	{
		"ques_body": "処理装置とバスについて",
		"ans": [
			["ベクトルプロセッサ", "処理すべきベクトルの長さがベクトルレジスタより長い場合、ベクトルレジスタ長の組に分割して処理を繰り返す方式"],
			["スーパーパイプライン", "パイプラインを更に細分化することによって高速化を図る方式（細かく分割して無駄な待ち時間を減らし効率化をはかる）"],
			["スーパスカラ", "複数のパイプラインを用いて、同時に複数の命令を実行可能にすることによって高速化を図る方式（パイプラインの処理系統を複数用意して効率化をはかる）"],
			["VLIW方式", "命令語を長くとり、一つの命令で複数の機能ユニットを同時に制御することによって高速化を図る方式（依存関係のない命令を一つの長い命令としてまとめる。命令の長さを統一することで回路を簡略化し、効率化をはかる）"]
		]
	},
	{
		"ques_body": "データの転送モードについて",
		"ans": [
			["アイソクロナス転送", "一定の帯域のデータ転送帯域を保証する。Webカメラやスピーカなどのリアルタイム性が求められるものに使用する"],
			["インタラプト転送", "マウスやキーボードのように一定周期で少量のデータを転送するときに使用する"],
			["コントロール転送", "装置の初期化や設定などに用いる。すべてのUSBデバイスが採用している。"],
			["バルク転送", "複数の通信回線を使用して大量のデータを一括で転送する。プリンタや磁気ディスクなどの大容量データの転送に使用される。"]
		]
	},
	{
		"ques_body": "インターフェースについて",
		"ans": [
			["IEEE 1394", "ハードディスクやデジタルビデオなどのマルチメディア機器で、高速（400Mbps）にデータを転送することができる。最大63台まで接続可能。"],
			["IrDA", "携帯電話同士でアドレス帳などのデータ交換を行う場合に使用される。赤外線を用いるデータ転送の規格"],
			["PIAFS", "PHSをコンピュータにつないで、高速なデータ通信をするための規格"],
			["RS-232C", "コンピュータと周辺機器を接続するためのシリアルインターフェース。D-Subピンが用いられる。"]
		]
	},
	{
		"ques_body": "タスクスケジューリング方式について",
		"ans": [
			["優先度順方式", "各タスクの優先度を決めて、優先度が高い順に実行する。実行中のタスクよりも優先度の高いものが待ち行列に追加されると、実行の途中でCPU使用権が奪われる"],
			["ラウンドロビン方式", "各タスクをCPU待ち行列に置かれた順に実行し、一定時間が経過したら実行を中断してCPU待ち行列の最後尾に加える。（一定時間ずつ割り当てて切り替える）"],
			["処理時間順方式", "処理予定時間が最も短いタスクから処理を実行する。予定時間の長いものは実行を待ち続ける場合もある"],
			["到着順方式", "タスクがシステムに到着した順に実行可能待ち行列の最後尾に加え、常に実行待ち行列の先頭のタスクにCPUを割りあてる"]
		]
	},
	{
		"ques_body": "ネットワークとIP電話について",
		"ans": [
			["IP電話機", "IPを利用して電話サービスを提供するIP電話サービスに対応した電話機のこと"],
			["VoIPゲートウェイ", "電話網とIPネットワークの間を中継する装置"],
			["ゲートキーパ", "電話番号とIPアドレスの対応付けなどを管理・運用する装置"],
			["ルータ", "ネットワーク上を流れるデータを他のネットワークに中継する装置。OSI参照モデルのネットワーク層など"]
		]
	},
	{
		"ques_body": "記述方法について",
		"ans": [
			["DML", "SQL言語などの関係データベースのレコードを制御する言語。"],
			["HTML", "Webページを記述するためのマークアップ言語。文書の論理構造や表示の仕方などを定義できる。"],
			["SGML", "タグを使って文書の論理構造や属性を記述する方法を定めた国際規格で、電子的な文書の管理や交換を容易におこなうための文書記述言語。（XMLやHTMLの元）"],
			["UML", "オブジェクト指向のソフトウェア開発におけるプログラム設計の統一された表記法"]
		]
	},
	{
		"ques_body": "画像符号化方式について",
		"ans": [
			["JPEG", "静止画データの圧縮符号化に関する国際規格。写真などの圧縮には効果的だが、コンピュータグラフィクスには向かない。"],
			["MPEG-1", "映像データの圧縮方式の一つで、VHS並みの画質の動画を再生できる。（1.5Mbpsほどの帯域）"],
			["MPEG-2", "映像データの圧縮方式の一つで、DVDやデジタルテレビなどで使用される（4-15Mbpsほどの帯域）"],
			["MPEG-4", "映像データの圧縮方式の一つで、携帯電話などの低速回線用の動画像の符号化に用いられる（64kbpsほどの帯域）"]
		]
	},
	{
		"ques_body": "データベースの障害の回復処理について",
		"ans": [
			["ウォームスタート方式", "コンピュータに電源が入っている状態でソフトウェアのリセットを行う。ディスク上のチェックポイントまで戻り、ログファイルの更新後情報を利用して回復する"],
			["コールドスタート方式", "コンピュータの電源が完全に切れている状態から再起動する。記憶媒体などの故障ではチェックポイントからの回復を断念し、バックアップファイルとログファイルの更新後情報を利用して回復する"],
			["ロールバック", "障害発生時に終了していないトランザクションを更新前の状態に戻すこと。"],
			["ロールフォワード", "更新情報のログをみて、チェックポイントからあとに正常終了したトランザクションの情報をデータベースに反映すること"]
		]
	},
	{
		"ques_body": "システム信頼化設計について",
		"ans": [
			["フールプルーフ", "オペレータが不注意による操作誤りを起こさないように、操作の確認などに配慮した設計"],
			["フェールセーフ", "システムの一部に異常や故障が発生したときに、その影響が小さくなるような設計"],
			["フォールトアボイダンス", "障害の発生を予防できるように、機器の定期保守を組み入れた運用システムの設計"],
			["フォールトトレラント", "装置を二重化し、一方が故障してもその装置を切り離してシステムの運用を継続できる設計"]
		]
	},
	{
		"ques_body": "コンピュータシステムの構成について",
		"ans": [
			["デュプレックスシステム", "通常は一方の処理装置は待機しており、本稼働している処理装置が故障すると、待機中の処理装置に切り替えて処理を続行する。"],
			["疎結合マルチプロセッサシステム", "複数のプロセッサが磁気ディスクを共用し、それぞれ独立したOSで制御される。ジョブ単位で負荷を聞さんすることで処理能力を向上させる。"],
			["密結合マルチプロセッサシステム", "複数のプロセッサが主記憶装置を共用し、単一のOSで制御される。システム内のタスクは、基本的にどのプロセッサでも実行できるので、細かい単位で負荷を分散することで処理能力を向上させる。"],
			["デュアルシステム", "並列に接続された２台の処理装置が同時に同じ処理を行い、相互に結果を照合する。一台のプロセッサが故障すると、それを切り離して処理を続行する。"]
		]
	},
	{
		"ques_body": "ページの置き換えアルゴリズムについて",
		"ans": [
			["LFU", "最も参照回数の少ないページを、追い出し対象にするアルゴリズム"],
			["FIFO", "最初にページインしたページを、追い出し対象にするアルゴリズム"],
			["LIFO", "最後にページインしたページを、追い出し対象にするアルゴリズム"],
			["LRU", "もっとも長い間参照されていないページを、追い出し対象にする"]
		]
	},
	{
		"ques_body": "ネットワークのアクセス制御方式について",
		"ans": [
			["トークンパッシング方式", "各ノードに論理的な順位付けを行い、送信権を順次受け渡し、これを受け取った各ノードだけが送信を行う"],
			["CSMA/CD方式", "各ノードは伝送媒体が使用中かどうかを調べ、使用中でなければ送信を行う。衝突を検出したらランダムな時間経過後に再度送信を行う。"],
			["TDMA（時分割多元接続）方式", "タイムスロットを割り当てられたノードだけが送信を行う"],
			["ATM方式", "情報を固定長のセルに分割して、ヘッダの宛先情報に基づいて非同期に伝送する"]
		]
	},
	{
		"ques_body": "サービス管理について",
		"ans": [
			["サービスレベル管理", "サービスの提供者が、サービスの品質について継続的・定期的に点検・検証し、品質を維持または改善すること"],
			["構成管理", "ITサービスを構成する構成品目に関する状態情報を管理し正確な情報を維持する"],
			["変更管理", "ITサービスの変更作業に伴うリスクを最小限に抑えながら、効果的・効率的な変更を管理する"],
			["インシデント管理", "利用者がシステムを正常に利用することを妨げる事象・現象に対応し、これを取り除くこと"]
		]
	},
	{
		"ques_body": "PPMについて",
		"ans": [
			["花形", "現在は大きな資金の流入をもたらしているが、同時に将来にわたって資金の投下が必要である"],
			["金のなる木", "現在は資金の主たる供給源に役割を果たしており、新たに資金を投入すべきではない"],
			["問題児", "現在は資金の流入は小さいが、資金投下を行えば、将来の資金供給源になる可能性がある"],
			["負け犬", "事業を継続させていくための資金投下の必要性は低く、将来的には撤退を考えざるを得ない"]
		]
	},
	{
		"ques_body": "違法行為について",
		"ans": [
			["不正競争防止法", "会社の重要情報にアクセスし得るものが株式発行の決定を知り、情報の公表前に当該会社の株を売買した"],
			["刑法", "コンピュータウイルスを作成し、他人のコンピュータの画面表示をでたらめにする被害をもたらした"],
			["著作権法", "自分自身で管理運営するホームページに、昨日の新聞に載った報道写真を新聞社に無断で掲載した"],
			["不正アクセス禁止法", "他人の利用者ID、パスワードを許可なく利用して、アクセス制御機能によって制限されているWEBサイトにアクセスした"]
		],
		"mode": 1
	},
	{
		"ques_body": "知的財産権について",
		"ans": [
			["特許権", "自然法則を利用した技術的思想の創作のうち高度なもの"],
			["著作権", "思想または感情を創作的に表現したもの"],
			["実用新案権", "物品の形状、構造または組合せにかかる考案"],
			["意匠権", "物品の形状、構造または色彩など、視覚を通じて美感を起こさせるもの"]
		]
	},
	{
		"ques_body": "WEBの技術について",
		"ans": [
			["WebDAV","HTTPプロトコルを用いて、XML形式やHTML形式のデータがファイアウォールを通過できるようにした通信形式"],
			["CSS（カスケードスタイルシート）", "スタイルシートを適用することによって、デザインを統一したり、保守性を高めたりする仕組み"],
			["HTTP", "ブラウザからの要求に対してWebサーバが応答し、テキスト・画像・音声・動画などをやり取りするための通信方式"],
			["Ajax", "ブラウザとWebサーバとがXML形式のデータを用いて非同期の通信をし、動的に画面を再描画する仕組み"]
		]
	},
	{
		"ques_body": "CGの技術について",
		"ans": [
			["アンチエイリアシング", "図形を描画する際に、図形の境界近くの画素に変化する色彩の中間色を割り当てることで、境界に生じる階段状のギザギザを目立たなくする"],
			["シェーディング", "光源とモデルの形状をもとに、モデルに陰影をつけ、立体感をつける処理"],
			["クリッピング", "画面が画像の一部分のみを表示したり、その部分だけを切り抜いて残し、ほかの部分を消去する処理や操作"],
			["モーフィング", "ある形状から別の形状に変化する様子を動画で表現するとき、その中間の状態を補うための画像を生成する"]
		]
	},
	{
		"ques_body": "LAN同士を接続する機器について",
		"ans": [
			["スイッチングハブ", "データリンク層で接続する装置"],
			["ハブ", "ネットワーク層で接続する装置"],
			["ゲートウェイ", "ネットワーク層よりも上位の層で接続する装置"],
			["リピータ", "物理層で接続する装置"]
		]
	},
	{
		"ques_body": "ネットワークに関する規格について",
		"ans": [
			["IPSec", "IPv6を利用した通信を行うとき、ネットワーク層で暗号化を行うのに利用する規格"],
			["PPP", "二台の機器の間で仮想的な専用の伝送路を確立し、相互に安定的にデータの送受信を行うことができるようにする通信プロトコル"],
			["SSH", "暗号や認証の技術を利用してネットワークを介して別のコンピュータにログインしたりコマンドを実行したりするためのプログラム"],
			["SSL", "セッション層とトランスポート層の境界で動作する。公開鍵暗号方式で認証し、共通鍵暗号方式で通信の暗号化を行う通信プロトコル"]
		]
	},
	{
		"ques_body": "プログラムの性質について",
		"ans": [
			["再帰的", "実行中に自分自身を呼び出すことができるプログラムの性質"],
			["再使用可能", "主記憶装置にロードされ処理を終えたプログラムを再ロードすることなく繰り返し実行できる性質"],
			["再入可能", "複数のタスクから呼び出されても、それぞれが互いに干渉することなく同時実行できる性質"],
			["再配置可能", "主記憶装置状のどこに置いても実行することができる性質"]
		]
	},
	{
		"ques_body": "開発手法について",
		"ans": [
			["バックトラッキング", "ある解を求めるときに、可能性のある解の候補を順に試していき、求まらないと判明した時点で一つ前の状態に戻って別の解を試すという方法"],
			["フォワードエンジニアリング", "リバースエンジニアリングによる解析から得た既存のシステムの仕様をもとに新規のシステムを開発すること"],
			["リバースエンジニアリング", "既存の製品やプログラムなどを分析し、仕様や構造を明らかにする技法。（分析結果はUMLなどの図で表す）"],
			["CORBA", "分散システム環境で、オブジェクト同士がメッセージを交換するための共通仕様のこと"]
		]
	},
	{
		"ques_body": "経営戦略について",
		"ans": [
			["アライアンス", "複数の企業が互いに経済的なメリットを享受するために、緩やかな協力体制を構築すること"],
			["コアコンピタンス", "他者にはまねのできない、企業独自のノウハウや技術などの強みを核とした経営を行うこと"],
			["ゴーイングコンサーン", "企業が将来にわたって無期限に事業を継続することを前提とする考え方"],
			["リエンジニアリング", "ビジネスプロセスを根本的に考え直し、抜本的にデザインしなおすことによって、企業のコスト、品質、サービス、スピードなどのパフォーマンスを改善すること"]
		]
	},
	{
		"ques_body": "ソフトウェアの種類について",
		"ans": [
			["オープンソースソフトウェア", "再配布の自由、再配布時のソースコード包有、派生ソフトウェア改変の許諾などが要求されるソフトウェア"],
			["コンポーネントウェア", "ソフトウェアを構成する部品を一つの独立したソフトウェアとして販売するもの"],
			["シェアウェア", "一定期間無料で試用することができ、継続利用する場合には定められた代金を支払うソフトウェア"],
			["ミドルウェア", "OS上で、OSとアプリケーションソフトウェアの中間的な処理・動作を行うソフトウェア"]
		]
	},
	{
		"ques_body": "財務諸表について",
		"ans": [
			["株主資本等変動計画書", "貸借対照表の純資産の部の変動状況を示す財務諸表のこと"],
			["キャッシュフロー計算書", "会社の活動を営業・投資・財務の三つにわけ、それぞれについて現金の増減に対する影響を整理したもの"],
			["損益計算書", "ある一定期間における収益とそれを得るために要した費用を明記し、その時点における純利益・純損失を算出したもの"],
			["貸借対照表", "一定時点における企業の資産、負債および純資産を表示し、企業の財務状態を明らかにするもの"]
		]
	},
	{
		"ques_body": "見積もりについて",
		"ans": [
			["ファンクションポイント法", "入力・出力などの複雑さを加味してシステム規模を見積もる方法であり、開発工数の見積もりに使われるもの"],
			["COCOMO", "開発するソフトウェアのコード行数を予想し、それにチームの開発能力などを掛け合わせて工程数や人員を見積もる手法"],
			["標準タスク法（≒ボトムアップ見積法）", "WBSに基づいて、成果物単位や処理単位に工数を見積もり、ボトムアップ的に積み上げていく手法"],
			["EVM", "コスト全額を基準に、予算に対する出来高を把握し、スケジュール管理を行うもの"]
		]
	},
	{
		"ques_body": "経営について",
		"ans": [
			["BPR", "顧客視点から業務のプロセスを再設計し、情報技術を十分に活用して、企業の体質や構造を抜本的に変革すること"],
			["ERP", "企業全体の経営資源の配分を有効かつ総合的に計画して管理し、経営の効率向上をはかること"],
			["ベンチマーキング", "最強の競合相手または先進企業と比較して、製品、サービス、オペレーションなどを定性的・定量的に把握すること"],
			["SCM", "生産、在庫、購買、販売、物流などのすべての情報をリアルタイムに交換することによって、サプライチェーン全体の効率を大幅に向上させる経営手法"]
		]
	},
	{
		"ques_body": "EM（エンタープライズアーキテクチャ）について",
		"ans": [
			["ビジネスアーキテクチャ", "業務機能を構成する"],
			["データアーキテクチャ", "業務機能に使われる情報を構成する"],
			["アプリケーションアーキテクチャ", "業務機能と情報の流れをまとめたサービスの固まりを構成する"],
			["テクノロジアーキテクチャ", "各サービスを実現するためのテクノロジを構成する"]
		]
	},
	{
		"ques_body": "経営・商取引について",
		"ans": [
			["EDI", "電子商取引に使われる企業間でデータを交換する仕組み"],
			["CRM", "企業内のすべての顧客チャネルで情報を共有し、サービスのレベルを引き上げて顧客満足度を高め、顧客ロイヤリティの最適化に結び付ける考え方"],
			["RFI", "システム化の目的や業務内容などを示し、ベンダに情報の提供を依頼すること"],
			["SOA", "業務上の一処理に相当するソフトウェアの機能をサービスとして実装し、それらのサービスを組み合わせてシステム全体を構築するという考え方"]
		]
	},
	{
		"ques_body": "演算精度と誤差について",
		"ans": [
			["情報落ち", "絶対値の大きな数と絶対値の小さな数の加減算を行ったとき、絶対値の小さな数の有効桁の一部または全部が反映されないこと"],
			["けた落ち", "絶対値のほぼ等しい数値の減算を行ったとき、有効桁数が急激に減少すること"],
			["オーバーフロー", "絶対値の大きな値同市の乗算・加算を行った場合、指数部が表現できる正の最大値を超える現象"],
			["打切り誤差", "ある程度の値で収束が確認できたところで処理を打ち切ることで発生する誤差"]
		]
	},
	{
		"ques_body": "認証・暗号化方式について",
		"ans": [
			["RADIUS", "無線LANやVPN接続などで利用される利用者を認証するためのシステム"],
			["RSA", "非常に大きな数の素因数分解が困難なことを利用した公開鍵暗号方式"],
			["DES", "米国で制定された共通鍵暗号方式。この後継としてAES（共通鍵暗号方式）がある。"],
			["IDS", "通信回線を監視し、ネットワークへの侵入を検知して管理者に通報するシステム。"]
		]
	},
	{
		"ques_body": "システム開発について",
		"ans": [
			["ホワイトボックステスト", "モジュールの内部構造によってテストケースを設定し、内部のエラーを発見するテスト技法"],
			["ワークサンプリング法", "観測回数・観測時刻を設定し、実地観測による観測点数の比率などから、統計的理論に基づいて作業時間を見積もる方法"],
			["ブラックボックステスト", "モジュールの内部構造は意識せず、入力に対して適切な出力が仕様通り得られているかを確認し、エラーを発見するテスト技法"],
			["リグレッションテスト", "プログラムを修正した時に、その修正内容がそれ以前に正常に動作していた範囲に悪影響を与えていないか確認するテスト"]
		]
	},
	{
		"ques_body": "経営戦略について",
		"ans": [
			["バランススコアカード", "企業の戦略を実現するために、財務、顧客、内部ビジネスプロセス、学習と成長の観点から戦略を検討したもの"],
			["PDCAサイクル", "企業の目標を達成するために業務内容や業務の流れを可視化し、一定のサイクルをもって継続的に業務プロセスを改善するもの"],
			["MRP", "完成品レベルの生産計画に基づいて生産に必要な資材の所要量を求め、品目、納期とあわせて生産計画を作り、それを基準にして資材の手配、納入、出庫の計画などを行う"],
			["BCP", "事業中断の計画とリスクを想定し、未然に回避または被害を受けても速やかに回復できるように方針や行動手順を規定したもの"]
		]
	},
	{
		"ques_body": "経営戦略について",
		"ans": [
			["CIO", "情報管理、情報システムの統括を含む戦略立案と執行を任務として設置した役員"],
			["PPM", "市場の成長率と自社の相対的市場シェアの組合せから、各事業の位置づけを明確にし、それぞれの事業の今後の施策を検討すること"],
			["マーケティングミックス", "製品戦略、価格戦略、チャネル戦略、プロモーション戦略などを適切に組み合わせて、自社製品を効果的に販売していくこと"],
			["プロダクトライフサイクル", "導入期、成長期、成熟期、衰退期のそれぞれにおいて、市場や競合商品などとの関係を意識した、適切な施策をとっていくこと"]
		]
	},
	{
		"ques_body": "アドレス演算について",
		"ans": [
			["間接アドレス指定", "アドレス部に記載されているアドレスの中に対象となるデータが入っている箇所のメモリアドレスが格納されている"],
			["相対アドレス指定", "アドレス部の値にプログラムカウンタの値を加えたものが有効アドレスとなる"],
			["即値アドレス指定", "アドレスの指定ではなく直接演算する値を指定する"],
			["指標アドレス指定", "アドレス部の値にインデックスレジスタの値を加えたものを有効アドレスとする"]
		]
	}
	
];
